[{"model": "about.about", "pk": 1, "fields": {"name": "Carrie McMeel", "bio": "5 years qualified, commercial, data protection and regulatory solicitor. Carrie regularly advises dog rescues in relation\r\nto legal issues as they arise for them. She has also extensively advised and drafted policies, agreements and\r\nprocedures for dog rescues. Carrie gives countless hours of volunteering at her local rescue, Dogs Aid and is the\r\nproud owner of her two gorgeous rescue dogs; Dots (Collon) &amp; Zag (Dogs Aid)", "image": "uploads/carrie-mcmeel.fecaef13bc7a.jpeg"}}, {"model": "about.about", "pk": 2, "fields": {"name": "Demi Mullen", "bio": "6 years qualified, investment funds solicitor. Demi co-established the Animal Law Network Ireland along with a\r\ncolleague in 2024 - a group for legal professionals and academics with an interest in animal law in Ireland. Demi has\r\npresented on dog law in Ireland at the UK Centre for Animal Law Conference and Causeway Coast Dog Rescue’s\r\nCompanion Animal Welfare Conference. Demi adopted her gorgeous furbaby Klaus from Cara Rescue in February\r\n2019.", "image": "uploads/demi-mullen.jpeg"}}, {"model": "about.about", "pk": 3, "fields": {"name": "Hannah Unger", "bio": "6 years qualified, public and regulatory law solicitor with Fieldfisher Ireland LLP. Along with her day to day work, she leads a pro bono team focused on reviewing dog laws and proposing reforms. In May 2024, Hannah published a report titled 'Key Reforms to Dog Breeding in Ireland' which she presented at Leinster House. In addition, she regularly shares her expertise in the media, contributing to both print and radio discussions on dog breeding reforms. Hannah also advises dog rescues in relation to legal issues as they arise for them and has assisted in drafting their policies and procedures. In addition, she advises private clients in relation to the Control of Dogs Act 1986 (as amended). Hannah fosters dogs for Dogs Angels Ireland and adopted the gorgeous Twinkle from Dogs Angels in 2022.", "image": "uploads/hannah-unger.jpeg"}}]